Revit.Elements.FilledRegionType
Revit filled Region Type

Revit.Elements.FilledRegionType.InternalRevitElement
Internal reference to the Revit Element

Revit.Elements.FilledRegionType.InternalElement
Reference to the Element

Revit.Elements.FilledRegionType.InternalSetElement(Autodesk.Revit.DB.FilledRegionType)
Set the internal Element, ElementId, and UniqueId

Revit.Elements.FilledRegionType.#ctor(Autodesk.Revit.DB.FilledRegionType)
FilledRegionType
FilledRegion:

Revit.Elements.FilledRegionType.ByName(System.String)
Select a FilledRegionType from the current document by name
name:
Returns:

Revit.Elements.FilledRegionType.Name
Get Name

Revit.Elements.FilledRegionType.Color
Get Color

Revit.Elements.FilledRegionType.FillPatternId
Get FillPatternId

Revit.Elements.FilledRegionType.InitElement(Autodesk.Revit.DB.FilledRegionType)
Init Element

Revit.Elements.FilledRegionType.FromExisting(Autodesk.Revit.DB.FilledRegionType,System.Boolean)
Create from existing
instance:
isRevitOwned:
Returns: